Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.
variable print it.

In [1]:
import pandas as pd

In [3]:
series = pd.Series([4,8,15,16,23,42])

In [4]:
series

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [5]:
type(series)

pandas.core.series.Series

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [6]:
lst = [1,2,3,4,'Naman','Krish','Sudh',45.44,'Om',99]

In [7]:
len(lst)

10

In [9]:
pd.Series(lst)

0        1
1        2
2        3
3        4
4    Naman
5    Krish
6     Sudh
7    45.44
8       Om
9       99
dtype: object

Q3. Create a Pandas DataFrame that contains the following data:

Then, print the DataFrame.

In [10]:
df = pd.DataFrame({'Name': ['Alice', 'Bob', 'Clarie'], 'Age': [25, 30, 27], 'Gender':['Female','Male','Female']})

In [11]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Clarie   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [ ]:
# DataFrame is a 2-dimensional labeled data structure with columns of potentially different types. we can think of it like a spreadsheet or SQL table,
# or a dict of Series objects. It is generally the most commonly used pandas object.

In [ ]:
# A pandas Series is a one-dimensional array. It holds any data type supported in Python and uses labels to locate each data value for retrieval.
# These labels form the index, and they can be strings or integers. A Series is the main data structure in the pandas framework for storing 
# one-dimensional data.

In [13]:
# DataFrame
df = pd.DataFrame({'Name': ['Alice', 'Bob', 'Clarie'], 'Age': [25, 30, 27], 'Gender':['Female','Male','Female']})
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Clarie   27  Female

In [15]:
type(df)

pandas.core.frame.DataFrame

In [14]:
# Series
a = [1, 7, 2]
v = pd.Series(a)
print(v)

0    1
1    7
2    2
dtype: int64

In [16]:
type(v)

pandas.core.series.Series

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of
these functions?

In [ ]:
# There are many functions which are used to manipulate data in data frame 
1. pd.read_csv, pd.read_excel
2. df.columns
3. df.drop()
4. .len()
5. df.query()
6. df.iloc()
7. df.loc()
8. df.insert()
9. df.head()
10. df[‘’].unique()

# And many more

In [18]:
df = pd.read_csv('taxonomy.csv.xls')

In [21]:
df.head()

  taxonomy_id                     name parent_id     parent_name
0         101                Emergency       NaN             NaN
1      101-01        Disaster Response       101       Emergency
2      101-02           Emergency Cash       101       Emergency
3   101-02-01        Help Pay for Food    101-02  Emergency Cash
4   101-02-02  Help Pay for Healthcare    101-02  Emergency Cash

In [22]:
df.tail()

    taxonomy_id                          name parent_id           parent_name
285   111-01-07              Workplace Rights    111-01  Advocacy & Legal Aid
286      111-02                     Mediation       111                 Legal
287      111-03                        Notary       111                 Legal
288      111-04                Representation       111                 Legal
289      111-05  Translation & Interpretation       111                 Legal

In [23]:
df.columns

Index(['taxonomy_id', 'name', 'parent_id', 'parent_name'], dtype='object')

In [24]:
df.dtypes

taxonomy_id    object
name           object
parent_id      object
parent_name    object
dtype: object

In [25]:
len(df)

290

In [26]:
df.drop(3)

    taxonomy_id                          name parent_id           parent_name
0           101                     Emergency       NaN                   NaN
1        101-01             Disaster Response       101             Emergency
2        101-02                Emergency Cash       101             Emergency
4     101-02-02       Help Pay for Healthcare    101-02        Emergency Cash
5     101-02-03          Help Pay for Housing    101-02        Emergency Cash
..          ...                           ...       ...                   ...
285   111-01-07              Workplace Rights    111-01  Advocacy & Legal Aid
286      111-02                     Mediation       111                 Legal
287      111-03                        Notary       111                 Legal
288      111-04                Representation       111                 Legal
289      111-05  Translation & Interpretation       111                 Legal

[289 rows x 4 columns]

In [27]:
df[0:5]

  taxonomy_id                     name parent_id     parent_name
0         101                Emergency       NaN             NaN
1      101-01        Disaster Response       101       Emergency
2      101-02           Emergency Cash       101       Emergency
3   101-02-01        Help Pay for Food    101-02  Emergency Cash
4   101-02-02  Help Pay for Healthcare    101-02  Emergency Cash

In [29]:
df['parent_id'].unique

<bound method Series.unique of 0         NaN
1         101
2         101
3      101-02
4      101-02
        ...
285    111-01
286       111
287       111
288       111
289       111
Name: parent_id, Length: 290, dtype: object>

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In [30]:
# Among Series, DataFrame and Panel, Series and DataFrame are mutable while Panel is ummutable.

# Series : It is mutable in nature as we change modify the data cotents after creation of series.
# DataFrame : It is also mutable that means we can change or alter data after the creation of dataframe
# Panel : Panel is ummutable, so we cannot change anything after we creat it

In [ ]:
Q7. Create a DataFrame using multiple Series. Explain with an example.

In [34]:
name = pd.Series(['Krish','Sudh','Hitesh'])
age = pd.Series([33,28,40])                                   # CREATING A MULTIPLE SERIES 
job = pd.Series(['Data_Scientist', 'Teacher', 'Web_developer'])

In [35]:
df = pd.DataFrame({'Name': name,
                  'Age': age,                     # PUTTING ALL THE SERIES IN ONE DATA FRAME 
                  'Job': job})

In [36]:
df          # PRINTING THE DATAFRAME

     Name  Age             Job
0   Krish   33  Data_Scientist
1    Sudh   28         Teacher
2  Hitesh   40   Web_developer